package com.example.annect.data

data class Quiz(val question: String, val correctAnswer: String)

val quizList = listOf(
    Quiz("世界で唯一、飛べないが泳げる鳥は何ですか？(カタカナ4文字)", "ペンギン"),
    Quiz("最も知能が高いとされる海洋生物は何ですか？(カタカナ3文字)", "イルカ"),
    Quiz("ウミガメの中で最も大きな種類は何ですか？(カタカナ4文字)", "オサガメ"),
    Quiz("環境によって体の色を変えることができるトカゲは何ですか？(カタカナ5文字)", "カメレオン"),
    Quiz("アフリカのサバンナで群れを作り、ライオンから仲間を守る動物は何ですか？(カタカナ6文字)", "バッファロー"),
    Quiz("砂漠に生息し、体を砂の下に埋めることで日焼けを防ぐ動物は何ですか？(カタカナ5文字)", "フェネック"),
    Quiz("昆虫の中で最も速く飛ぶことができる種類は何ですか？(カタカナ3文字)", "トンボ"),
    Quiz("動物界で最も長い舌を持つ生物は何ですか？(カタカナ14文字)", "チューブリップマンティス"),
    Quiz("ミツバチが蜜を集める際に、主に訪れる植物の部位は何ですか？(漢字1文字)", "花"),
    Quiz("オオカミが群れを作る際、群れを指導するオオカミの呼び名は何ですか？(カタカナ4文字)", "アルファ"),
    Quiz("キツネが冬に変える、保温効果のある毛皮の色は何ですか？(漢字1文字)", "白"),
    Quiz("インディアンクレイヴフィッシュが持っている、特殊な防御機構は何ですか？(漢字1文字)", "毒"),
    Quiz("世界で最も速く走れる陸上動物は何ですか？(カタカナ4文字)", "チーター"),
    Quiz("黒と白のストライプが特徴的な動物は何ですか？(カタカナ4文字)", "シマウマ"),
    Quiz("フルーツを食べ、飛ぶことができる哺乳動物は何ですか？(カタカナ4文字)", "コウモリ"),
    Quiz("一番大きな陸上動物は何ですか？(カタカナ2文字)", "ゾウ"),
    Quiz("ハチドリは何を食べることでエネルギーを得ていますか？(カタカナ4文字)", "ネクター"),
    Quiz("オーストラリア原産で袋に赤ちゃんを運ぶ動物は何ですか？(カタカナ5文字)", "カンガルー"),
    Quiz("北極に生息している、大きな白いクマは何ですか？(カタカナ4文字)", "シロクマ"),
    Quiz("世界で最も重い鳥は何ですか？(カタカナ4文字)", "ダチョウ"),
    Quiz("細長い体と短い足を持つ、穴を掘るのが得意な動物は何ですか？(カタカナ3文字)", "モグラ"),
    Quiz("カメレオンが特殊な何を持っていることで有名ですか？(漢字1文字)", "舌"),
    Quiz("砂漠の動物で、背中にこぶがあるのは何ですか？(カタカナ3文字)", "ラクダ"),
    Quiz("ジャングルで最も大きなネコ科の動物は何ですか？(カタカナ2文字)", "トラ"),
    Quiz("多くの種が絶滅の危機に瀕している、黒と白の熊は何ですか？(カタカナ3文字)", "パンダ"),
    Quiz("長い首と長い舌が特徴的なアフリカの動物は何ですか？(カタカナ3文字)", "キリン"),
)